SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( BNSF_SD40-2_6801s
      Type ( Engine )
	WagonShape ( BNSF_SD40-2_6801s.s )
	Size ( 3.594m 4.431m 22m )  
	Mass ( 166.8t )
	WheelRadius ( 20in )
	InertiaTensor ( Box ( 3.594m 4.431m 22m ) )
	Coupling (
		Type ( Automatic )
		Spring (
			Stiffness ( 1e6N/m 5e6N/m )
			Damping ( 1e6N/m 1e6N/m )
			Break ( 5.1e7N 5.1e7N )
			r0 ( 20cm 30cm )
		)
		comment( CouplingHasRigidConnection () )
		Velocity ( 0.1m/s )
	)
	Buffers (
		Spring (
			Stiffness ( 1e6N/m 5e6N/m )
			Damping ( 1e6N/m/s 1e6N/m/s )
			r0 ( 0m 1e9 )
		)
		Centre ( 0.5 )
		Radius ( 1 )
		Angle ( 0.5deg )
	)
	
	Adheasion ( 0.25 0.48 2 0 )
	DerailRailHeight ( 4cm )
	DerailRailForce ( 2.5*166.8t )
	DerailBufferForce ( 200kN )
	NumWheels ( 1 )
	Friction (
		1842N/m/s		0		1mph		85.35N/m/s			1.8
		5.1N/rad/s		1		-1rad/s		0		1
	)
	

	BrakeEquipmentType( "Triple_valve, Auxilary_reservoir, Emergency_brake_reservoir" )

	BrakeSystemType( "Air_single_pipe" )
	MaxBrakeForce( 91.78kN )

	EmergencyBrakeResMaxPressure( 90 )
	TripleValveRatio( 2.5 )
	MaxReleaseRate( 15 )
	MaxApplicationRate( 10 )
	MaxAuxilaryChargingRate( 2 )
	EmergencyResCapacity( 11 )
	EmergencyResChargingRate( 18 )

	BrakeCylinderPressureForMaxBrakeBrakeForce( 64 )


	          Lights	(	35
            Light	(
			comment( Sphere of light Dim )
			Type		( 1 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 2 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.75 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFEDF93 )
					Position ( 0.0 3.2 7.5 )
					Transition ( 0.0 )
					Radius ( 400.0 )
					Angle ( 25.0 )
					)
				)
			)
             Light	(
			comment( Sphere of Running Lights )
			Type		( 1 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			Cycle	( 0 )
			FadeIn	( 0.7 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFFE4AB )
					Position ( 0.0 3.2 7.5 )
					Transition ( 0 )
					Radius ( 600.0 )
					Angle ( 30.0 )
					)
				)
			)
            Light	(
			comment( Top Hood Light Dim )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 2 )
				)
			FadeIn	( 0.6 )
			FadeOut	( 0.6 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFEDF93 )
					Position ( -0.015 3.175 10.1 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( .45 )
					)
				)
			)
            Light	(
			comment( Bottom Hood Light Dim )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 2 )
				)
			FadeIn	( 0.6 )
			FadeOut	( 0.6 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFEDF93 )
					Position ( -0.015 2.97 10.095 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( .45 )
					)
				)
			)
            Light	(
			comment( Hood Light Top )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			FadeIn	( 0.7 )
			FadeOut	( 0.8 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFFE4AB )
					Position ( -0.015 3.175 10.1 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.9 )
					)
				)
			)
		Light	(
			comment( Hood Light Bottom )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFFE4AB )
					Position ( -0.015 2.97 10.095 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.9 )
					)
				)
			)
		Light	(
			comment( Right Ditch Light )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFFE4AB )
					Position ( 0.745 1.885 10.54 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 1.0 )
					)
				)
			)
		Light	(
			comment( Left Ditch Light )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFFE4AB )
					Position ( -0.79 1.885 10.54 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 1.0 )
					)
				)
			)
            Light	(
			comment( Left Board Light )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 2 )
                        Service ( 2 )
                        TimeOfDay ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFEDF93 )
					Position ( -0.475 4.17 7.125 )
					Azimuth ( -29.0 -29.0 -29.0 )
					Transition ( 0 )
					Radius ( 0.45 )
					)
				)
			)
		Light	(
			comment(  Right Board Light )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 2 )
                        Service ( 2 )
                        TimeOfDay ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFEDF93 )
					Position ( 0.48 4.17 7.125 )
					Azimuth ( 29.0 29.0 29.0 )
					Transition ( 0 )
					Radius ( 0.45 )
					)
				)
			)	
            Light	(
			comment( Front Left Step Light )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFEDF93 )
					Position ( -.965 1.40 10.085 )
					Azimuth ( -90.0 -90.0 -90.0 )
					Transition ( 0 )
					Radius ( 0.20 )
					)
				)
			)
		Light	(
			comment( Front Right Step Light )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFEDF93 )
					Position ( .975 1.40 10.095 )
					Azimuth ( 90.0 90.0 90.0 )
					Transition ( 0 )
					Radius ( 0.20 )
					)
				)
			)
		
        #( Rear Left Step Light )
		Light	(
				Type		( 0 )
				Conditions	(
							Headlight ( 0 )
							Unit ( 0 )
						)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle	( 0 )
				States	(	1
							State	(
					Duration ( 0.0 )
					LightColour ( ffFEDF93 )
					Position ( -.96 1.40 -10.415 )
					Azimuth ( -90 -90 -90  )
					Transition ( 0 )
					Radius ( 0.20 )
								)
						)
			)
		#( Rear Right Step Light )
		Light	(	
				Type		( 0 )
				Conditions	(
					Headlight ( 0 )
					Unit ( 0 )
						)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle	( 0 )
				States	(	1
							State	(
				Duration ( 0.0 )
				LightColour ( ffFEDF93 )
				Position ( .965 1.40 -10.42 )
				Azimuth ( 90 90 90 )
				Transition ( 0 )
				 Radius ( 0.20 )
								)
						)
			)
          Light	(
			comment(  Front Left Deck Light )
			Type		( 0 )
			Conditions	(
				Service ( 2 )
				Unit ( 2 )
                        TimeOfDay ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFFE4AB )
					Position ( -0.090 1.86 10.055  )
					Azimuth ( -29 -29 -29 )
					Transition ( 0 )
					Radius ( 0.13 )
					)
				)
			)
             Light	(
			comment(  Front Right Deck Light )
			Type		( 0 )
			Conditions	(
				Service ( 2 )
				Unit ( 2 )
                        TimeOfDay ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFFE4AB )
					Position ( 0.07 1.865 10.06  )
					Azimuth ( 29 29 29 )
					Transition ( 0 )
					Radius ( 0.13 )
					)
				)
			)
            Light	(
			comment( Rear Left Deck Light )
			Type		( 0 )
			Conditions	(
				Service ( 2 )
				Unit ( 2 )
                        TimeOfDay ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFFE4AB )
					Position ( -0.075 1.865 -8.88  )
					Azimuth ( -151 -151 -151 )
					Transition ( 0 )
					Radius ( 0.13 )
					)
				)
			)
             Light	(
			comment( Rear Right Deck Light )
			Type		( 0 )
			Conditions	(
				Service ( 2 )
				Unit ( 2 )
                        TimeOfDay ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFFE4AB )
					Position ( 0.075 1.865 -8.88  )
					Azimuth ( 151 151 151 )
					Transition ( 0 )
					Radius ( 0.13 )
					)
				)
			)
            Light	(
			comment( long hood F.S. Deck step light )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
                        Service ( 2 )
                        TimeOfDay ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFFE4AB )
					Position ( -1.01 1.77 -5.68  )
					Azimuth ( -60 -90 -120 )
					Transition ( 0 )
					Radius ( 0.16 )
					)
				)
			)
           Light (
			comment( Right Rear Light )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			Cycle	( 0 )
			FadeIn	( 0.6 )
			FadeOut	( 0.6 )
			States	(	1
	                  State	(
					Duration ( 0.0 )
					LightColour ( ffFFE4AB )
					Position ( 0.115 3.875 -8.95 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.300 )
					)
				)
			)		
		Light	(
                        comment( Left Rear Light )
				Type		( 0 )
				Conditions	(
							Headlight ( 3 )
							Unit ( 2 )
						)
				FadeIn	( 0.6 )
				FadeOut	( 0.6 )
				Cycle	( 0 )
				States	(	1
							State	(
			       Duration ( 0.0 )
				  LightColour ( ffFFE4AB )
				Position ( -0.125 3.875 -8.95 )
				 Azimuth ( -180 -180 -180 )
				Transition ( 0 )
				Radius ( 0.300 )
								)
						)
			)
               Light	(
			comment( Right Truck lighta )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.7 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFEDF93 )
					Position ( 1.475 1.275 5.8 )
					Azimuth ( 90.0 90.0 90.0 ) 
                              Transition ( 0.0 )
					Radius ( 0.3 )
					Angle ( 10.0 )
					)
				)
			)
            Light	(
			comment( Right Truck lightb )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.7 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFEDF93 )
					Position ( 1.475 1.275 5.8 )
					Azimuth ( 90.0 90.0 90.0 ) 
                              Transition ( 0.0 )
					Radius ( 0.3 )
					Angle ( 10.0 )
					)
				)
			)
            Light	(
			comment( Left Truck lighta )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.7 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFEDF93 )
					Position ( -1.475 1.275 5.8 )
					Azimuth ( -90.0 -90.0 -90.0 )
                              Transition ( 0.0 )
					Radius ( 0.3 )
					Angle ( 10.0 )
					)
				)
			)
           Light	(
			comment( Left Truck lightb )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.7 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFEDF93 )
					Position ( -1.475 1.275 5.8 )
					Azimuth ( -90.0 -90.0 -90.0 )
                              Transition ( 0.0 )
					Radius ( 0.3 )
					Angle ( 10.0 )
					)
				)
			)
              #( Front Right Bogie light Mid )
		Light	(	
				Type		( 0 )
				Conditions	(
							Headlight ( 3 )
							Unit ( 0 )
						)
				FadeIn	( 0.2 )
				FadeOut	( 0.2 )
				Cycle	( 0 )
				States	(	1
					State	(
				Duration ( 0.0 )
				LightColour ( ffFEDF93 )
				Position ( 1.475 1.275 5.8 )
				Azimuth ( 90.0 -10.0 10.0 )
				Transition ( 0 )
				Radius ( .3 )
								)
						)
			)
		#( Front Left Bogie light Full )
		Light	(
				Type		( 0 )
				Conditions	(
							Headlight ( 2 )
							Unit ( 0 )
						)
				FadeIn	( 0.9 )
				FadeOut	( 0.5 )
				Cycle	( 0 )
				States	(	1
					State	(
				   Duration ( 0.0 )
				LightColour ( ffFEDF93 )
				Position ( -1.475 1.275 5.8 )
				Azimuth ( 90.0 -10.0 10.0 )
				Transition ( 0 )
				Radius ( .3 )
								)
						)
			)
		Light	(
			comment( Rear Right Bogie light )
				Type		( 0 )
				Conditions	(
					Headlight ( 2 )
					Unit ( 0 )
					)
				FadeIn	( 0.9 )
				FadeOut	( 0.5 )
				Cycle	( 0 )
				States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFEDF93 )
					Position ( 1.475 1.275 5.8 )
					Azimuth ( 110 110 110 )
					Transition ( 0 )
					Radius ( 0.3 )
					)
				)
			)
		Light	(
			comment( Rear Left Bogie Light )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 0 )
				)
			FadeIn	( 0.9 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffFEDF93 )
					Position ( -1.475 1.275 5.8 )
					Azimuth ( -110 -110 -110 )
					Transition ( 0 )
					Radius (0.3 )
					)
				)
			)
					)
		 Light	(     Comment ( AI section )
				Type		( 0 #Hood Light Top)
				Conditions	(
							Control ( 1 )
							Unit ( 2 )
                                          Service ( 2 )
                                          TimeOfDay ( 0 )
						)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	1
					State	(
						Duration ( 0.0 )
						LightColour ( ffFFE4AB  )
						Position ( -0.015 3.175 10.1 )
						Azimuth ( 0.0 0.0 0.0 )
						Transition ( 0 )
						Radius ( 0.75 )
								)
						)
			)
           Light	(
				Type		( 0 #Hood Light Bottom)
				Conditions	(
							Control ( 1 )
							Unit ( 2 )
                                          Service ( 2 )
                                          TimeOfDay ( 0 )
						)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	1
					State	(
						Duration ( 0.0 )
						LightColour ( ffFFE4AB  )
						Position ( -0.015 2.97 10.095 )
						Azimuth ( 0.0 0.0 0.0 )
						Transition ( 0 )
						Radius ( 0.75 )
								)
						)
			)
           Light	(
				Type		( 0 )
                        Comment ( Left Ditch Light )
				Conditions	(
							Control ( 1 )
							Unit ( 2 )
                                          Service ( 2 )
                                          TimeOfDay ( 0 )
						)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	1
					State	(
						Duration ( 0.0 )
						LightColour ( ffFFE4AB  )
						Position ( -0.79 1.885 10.54 )
						Azimuth ( 0.0 0.0 0.0 )
						Transition ( 0 )
						Radius ( 0.8 )
								)
						)
			)

		Light	(
				Type		( 0 )
                        Comment ( Right Ditch Light )
				Conditions	(
							Control ( 1 )
							Unit ( 2 )
                                          Service ( 2 )
                                          TimeOfDay ( 0 )
						)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	1
					State	(
						Duration ( 0.0 )
						LightColour ( ffFFE4AB  )
						Position ( 0.745 1.885 10.54 )
						Azimuth ( 0.0 0.0 0.0 )
						Transition ( 0 )
						Radius ( 0.8 )
								)
						)
			)		 
	Sound ( "..\\..\\sd402\\sound\\sd402eng.sms" )

)

Engine ( BNSF_SD40-2_6801s
	Effects
	(
		DieselSpecialEffects
		(
			_skip
			(
				the format of these little blocks is as follow:

				offset.x offset.y offset.z
				normal.x normal.y normal.z
				width in metres

				defining the offset from the shape pivot point
				where steam / smoke should appear, the direction
				it should go and the width of the nozzle
			)

			Exhaust1
			(
                                0.00 4.57 1.56
				0 1 0
				0.19
			)
		)
        )
        
	Wagon ( BNSF_SD40-2_6801s )
	Type ( Diesel )
	MaxPower ( 2244kW)
	MaxForce ( 428.141kN )
	MaxContinuousForce ( 369.6kN )
	MaxVelocity ( 65mph )
	MaxCurrent ( 1800A  )
	WheelRadius ( 20in )

	Sanding ( 1e9mph #sanding system is switched off when faster than given velocity )

	NumWheels ( 1 )
	MaxTemperature ( 120 )
	MaxOilPressure ( 90 )

	CabView ( EMD-2-SS.cvf )
	HeadOut ( 1.7 3.4 5.9 )
      MaxDieselLevel ( 4000gal )
	DieselUsedPerHourAtMaxPower ( 164.4gal )
	DieselUsedPerHourAtIdle ( 5.2gal )

	AirBrakesAirCompressorPowerRating( 7 )
	AirBrakesMainMinResAirPressure( 30 )
	AirBrakesMainMaxAirPressure( 110 )
	AirBrakesMainResVolume( 11 )
	AirBrakesAirCompressorWattage( 19000 )
	AirBrakesCompressorRestartPressure( 100 )
	AirBrakesAirUsedPerPoundsOfBrakePipePressure( 0.5 )
	AirBrakesHasLowPressureTest( 1 )
	AirBrakesIsCompressorElectricOrMechanical( 1 )


	EngineBrakesControllerMinPressureReduction( 6 )
	TrainBrakesControllerMinPressureReduction( 6 )
	EngineBrakesControllerHasProportionalBrake( 1 )
	EngineBrakesProportionalBrakeLag( 0.45 )
	EngineBrakesControllerMaxApplicationRate( 20 )
	TrainBrakesControllerMaxApplicationRate( 20 )
	EngineBrakesControllerMaxReleaseRate( 20 )
	TrainBrakesControllerMaxReleaseRate( 20 )
	EngineBrakesControllerEmergencyApplicationRate( 50 )
	TrainBrakesControllerEmergencyApplicationRate( 50 )
	EngineBrakesControllerMinSystemPressure( 0 )
	TrainBrakesControllerMinSystemPressure( 0 )
	EngineBrakesControllerMaxSystemPressure( 90 )
	TrainBrakesControllerMaxSystemPressure( 90 )
	EngineBrakesControllerEmergencyBrakeTimePenalty( 60 )
	TrainBrakesControllerEmergencyBrakeTimePenalty( 60 )
	EngineBrakesControllerFullServicePressureDrop( 26 )
	TrainBrakesControllerFullServicePressureDrop( 26 )


	DynamicBrakesMinUsableSpeed( 3 )
	DynamicBrakesMaximumEffectiveSpeed( 25 )
	DynamicBrakesMaximumForce( 267kN )
	DynamicBrakesResistorCurrentLimit ( 700 )
	DynamicBrakesCutInSpeed( 5 )
	DynamicBrakesMaxAirBrakePressure ( 50 )
	DynamicBrakesFadingSpeed( 7 )
	DynamicBrakesDelayTimeBeforeEngaging ( 8 )
	DynamicBrakesMaximumSpeedForFadeOut ( 415 )
	DynamicBrakesEffectAtMaximumFadeOut( 0 )
	DynamicBrakesHigherSpeedCurveExponent( 10.2 )
	DynamicBrakesLowerSpeedCurveExponent( 0.9 )
	DynamicBrakesNumberOfControllerNotches( 1 )
      DynamicBrakeHasAutoBailOff ( 1 )
	BrakesEngineBrakeType( "Air_single_pipe"  )
	BrakesTrainBrakeType( "Air_single_pipe" )
        BrakesEngineControllers( "Independent, Train, Dynamic" )

	MaxDieselLevel ( 4000gal )
	DieselUsedPerHourAtMaxPower ( 164.4gal )
	DieselUsedPerHourAtIdle ( 5.2gal )

	DieselSmokeEffectInitialMagnitude( 1.2 )
	DieselSmokeEffectMaxMagnitude( 1.8 )

	DieselSmokeEffectInitialSmokeRate( 0.4 )
	DieselSmokeEffectMaxSmokeRate( 3.1 )

	DieselEngineIdleRPM( 318 )
	DieselEngineMaxRPM( 904 )
	DieselEngineSpeedOfMaxTractiveEffort( 11.1mph )
      DieselEngineMaxRPMChangeRate( 30 )
      DoesHornTriggerBell ( 0 )
  
 	EmergencyStopMonitor(
    		MonitoringDeviceMonitorTimeLimit( 0 )
    		MonitoringDeviceAlarmTimeLimit( 0 )
    		MonitoringDevicePenaltyTimeLimit( 0 )
    		MonitoringDeviceCriticalLevel( 0 )
    		MonitoringDeviceResetLevel( 0 )
    		MonitoringDeviceAppliesFullBrake( 0 )
    		MonitoringDeviceAppliesEmergencyBrake( 1 )
    		MonitoringDeviceAppliesCutsPower( 0 )
    		MonitoringDeviceAppliesShutsDownEngine( 0 )
    		)

	AWSMonitor(
		MonitoringDeviceMonitorTimeLimit( -1 )
		MonitoringDeviceAlarmTimeLimit( 5 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 0 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 0 )
		MonitoringDeviceAppliesEmergencyBrake( 1 )
		MonitoringDeviceAppliesCutsPower( 0 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
		)
		
	VigilanceMonitor(
		MonitoringDeviceMonitorTimeLimit( 20 )
		MonitoringDeviceAlarmTimeLimit( 10 )
		MonitoringDevicePenaltyTimeLimit( 7 )
		MonitoringDeviceCriticalLevel( 0 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 1 )
		MonitoringDeviceAppliesEmergencyBrake( 0 )
		MonitoringDeviceAppliesCutsPower( 0 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
		)

	EngineBrakesControllerDirectControlExponent( 1 )

        EngineControllers (
            Throttle ( 0 1 0.125 0 
                NumNotches ( 9
                    Notch ( 0       0 Dummy )
                    Notch ( 0.125   0 Dummy )
                    Notch ( 0.25    0 Dummy )
                    Notch ( 0.375   0 Dummy )
                    Notch ( 0.5     0 Dummy )
                    Notch ( 0.625   0 Dummy )
                    Notch ( 0.75    0 Dummy )
                    Notch ( 0.875   0 Dummy )
                    Notch ( 1       0 Dummy )
                )
            )
            Brake_Engine ( 0 1 0.0125 0 
                NumNotches ( 2
                    Notch( 0   0 EngineBrakesControllerReleaseStart )
                    Notch( 0.3 1 EngineBrakesControllerGraduatedSelfLapLimitedStart )
                )
            )
            Brake_Train ( 0 1 0.0125 0.65 
                NumNotches ( 5
                    Notch( 0    0 TrainBrakesControllerReleaseStart )
                    Notch( 0.3  1 TrainBrakesControllerGraduatedSelfLapLimitedStart )
                    Notch( 0.85 0 TrainBrakesControllerSuppressionStart )
                    Notch( 0.9  0 TrainBrakesControllerContinuousServiceStart )
                    Notch( 0.95 0 TrainBrakesControllerEmergencyStart )
                )
            )
            Brake_Dynamic ( 0 1 0.11 0 
                NumNotches ( 10 
                	Notch ( 0       0 Dummy )
                    	Notch ( 0.11    0 Dummy )
                  	Notch ( 0.22    0 Dummy )
                   	Notch ( 0.33    0 Dummy )
                   	Notch ( 0.44    0 Dummy )
                   	Notch ( 0.55    0 Dummy )
                   	Notch ( 0.66    0 Dummy )
                   	Notch ( 0.77    0 Dummy )
                   	Notch ( 0.88    0 Dummy )
                   	Notch ( 1       0 Dummy )
                )
            )
            DirControl ( -1 0 1 1 )
            BellToggle( 0 1 0 )
            AWS ( 0 1 0 )
            Sanding ( 0 1 0 )
            Horn ( 0 1 0 )
            Wipers ( 0 1 0 )
            EmergencyStopResetToggle( 0 1 0 )
            EmergencyStopToggle( 0 1 0 )
            Vigilance ( 0 1 0 )
            Headlights ( 0 0.25 1 0 )
        )
 	Sound ( "..\\..\\sd402\\sound\\sd402cab.sms" )
	Name ( "ATSF SD40-2 3412" )
 	Description (
	"The EMD-SD40-2, an aging diesel-electric locomotive, most effective "+
	"pulling heavy loads over long stretches at slow speeds.\n\n"+
	"Locomotive type: Diesel-Electric\n\n"+
	"Power: 3,000 hp\n\n"+
	"Max. speed: 65 mph (107 km/h)\n\n"+
	"Gear ratio: 65:15\n\n"+
	"Power source: Diesel engine\n\n"+
	"Alternator: GMG 197\n\n"+
	"Max. starting tractive effort: 96,250 lb \n\n"+
	"Max. continuous tractive effort: 83,100 lb \n\n"+
	"Wheel configuration: Twelve 42-inch (16.5 cm) diameter in C-C configuration (two sets of three "+
	"driven axles)\n\n"+
	"Height: 15 ft. 5 in. (4.70 m)\n\n"+
	"Width: 10 ft. 3 in. (3.12 m)\n\n"+
	"Length: 59 ft. 2 in. (22.25 m)\n\n"+
	"Weight: 184 U.S. tons (166.8 metric tons)"	
 	)
	EngineOperatingProcedures (
	"To move forward\n"+
	"1.	Press the W key to move the Reverser to Forward.\n"+
	"2.	Press the ; (SEMICOLON) key to release the train brakes.\n"+
	"3.	Press the [ (LEFT BRACKET) key to release the locomotive brake.\n"+
	"4.	Press the D key to move the throttle from Idle to Notch 1.\n"+  
	"5.	Gradually increase power (D key), one notch at a time, until your train reaches the desired speed.\n\n"+
	"To slow the train\n"+
	"1.	Press the A key to move the throttle to a lower setting.\n"+
	"2.	Use the brakes to further reduce speed if desired.\n\n"+  
	"To apply the dynamic brakes\n"+
	"1.	Press the A key to move the throttle to the Idle position.\n"+
	"2.	Wait for 10 seconds, then press the . (PERIOD) key to advance the Dynamic Brake handle from Off to the Setup position.  After allowing a few seconds for braking circuit setup, press the . [PERIOD] key again to set the desired level of dynamic braking (Levels 1 - 8).\n\n"+
	"To release the dynamic brakes\n"+
	"1.	Press the D key to move the throttle towards Idle.\n\n"+
	"To apply the train brakes\n"+
	"1.	Press the ' (APOSTROPHE) key to apply the train brakes.\n\n"+
	"To bail off the train brakes on the locomotive\n"+
	"1. Press the / (FORWARD SLASH) key.\n\n"+
	"To release the train brakes\n"+
	"1. Press the ; (SEMICOLON) key to release the train brakes.\n\n"+
	"To apply the locomotive brake\n"+
	"1.	Press the ] (RIGHT BRACKET) key to apply the locomotive brake.\n\n"+
	"To release the locomotive brake\n"+
	"1. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n\n"+
	"To activate emergency braking\n"+
	"1.	Press the A key to reduce the throttle to Idle.\n"+
	"2.	Press the BACKSPACE key to activate emergency braking.\n\n"+
	"To back up\n"+
	"1.	Bring your train to a full stop.\n"+ 
	"2.	Press the S key to move the Reverser to the Reverse position.\n"+
	"4.	Release the brakes.\n"+
	"5.	Slowly advance the throttle lever (D key).\n\n"+
	"To couple to a car or locomotive\n"+
	"1. Coast into the unit at a very slow speed, about 2 mph.\n"+
	"TIP: To use the Coupling view, press the 6 key.\n"+
	"2. Press F9 to open the Train Operations window.\n"+
	"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
	"4. Close the Train Operations window.\n\n"+
	"To uncouple from a car or locomotive\n"+
	"1. Press F9 to open the Train Operations window.\n"+
	"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
	"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
	"4. Close the Train Operations window."
	) 

)
